app/controllers/posts_controller.rb

	def update
		# raise params.inspect
		# Query the database for the Post record that matches the :id passed to the
		# route.
		# Store the query in an instance variable.
		@post = Post.find(params[:id])
		# Update the values passed from the form
		# Save the changes in the database.
		@post.update(title: params[:title], description: params[:description])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "La NUEVA"], ["description", "A ver si esta vez funciona...¡por favor!"], ["updated_at", "2018-08-11 20:47:45.194427"], ["id", 2]]